; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck obj - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-5-5-20)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	package12 - obj
	package13 - obj
	package14 - obj
	package15 - obj
	package16 - obj
	package17 - obj
	package18 - obj
	package19 - obj
	package20 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	s11 - location
	s12 - location
	s13 - location
	s14 - location
	s15 - location
	s16 - location
	s17 - location
	s18 - location
	s19 - location
	p0-5 - location
	p0-9 - location
	p1-7 - location
	p1-9 - location
	p2-4 - location
	p2-10 - location
	p2-12 - location
	p3-13 - location
	p3-18 - location
	p5-2 - location
	p5-3 - location
	p5-15 - location
	p5-16 - location
	p6-0 - location
	p6-10 - location
	p6-15 - location
	p6-19 - location
	p7-0 - location
	p7-1 - location
	p7-4 - location
	p7-5 - location
	p10-11 - location
	p11-3 - location
	p11-8 - location
	p12-8 - location
	p13-5 - location
	p13-12 - location
	p16-6 - location
	p17-10 - location
	p18-4 - location
	p18-8 - location
	p18-14 - location
	p18-17 - location
	p19-18 - location
	)
	(:init
	(at driver1 s11)
	(at driver2 s6)
	(at driver3 s1)
	(at driver4 s2)
	(at driver5 s4)
	(at truck1 s12)
	(empty truck1)
	(at truck2 s3)
	(empty truck2)
	(at truck3 s8)
	(empty truck3)
	(at truck4 s8)
	(empty truck4)
	(at truck5 s2)
	(empty truck5)
	(at package1 s3)
	(at package2 s18)
	(at package3 s0)
	(at package4 s2)
	(at package5 s3)
	(at package6 s10)
	(at package7 s7)
	(at package8 s7)
	(at package9 s18)
	(at package10 s3)
	(at package11 s16)
	(at package12 s10)
	(at package13 s13)
	(at package14 s14)
	(at package15 s3)
	(at package16 s2)
	(at package17 s18)
	(at package18 s15)
	(at package19 s16)
	(at package20 s9)
	(path s0 p0-5)
	(path p0-5 s0)
	(path s5 p0-5)
	(path p0-5 s5)
	(path s0 p0-9)
	(path p0-9 s0)
	(path s9 p0-9)
	(path p0-9 s9)
	(path s1 p1-7)
	(path p1-7 s1)
	(path s7 p1-7)
	(path p1-7 s7)
	(path s1 p1-9)
	(path p1-9 s1)
	(path s9 p1-9)
	(path p1-9 s9)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(path s2 p2-10)
	(path p2-10 s2)
	(path s10 p2-10)
	(path p2-10 s10)
	(path s2 p2-12)
	(path p2-12 s2)
	(path s12 p2-12)
	(path p2-12 s12)
	(path s3 p3-13)
	(path p3-13 s3)
	(path s13 p3-13)
	(path p3-13 s13)
	(path s3 p3-18)
	(path p3-18 s3)
	(path s18 p3-18)
	(path p3-18 s18)
	(path s5 p5-2)
	(path p5-2 s5)
	(path s2 p5-2)
	(path p5-2 s2)
	(path s5 p5-3)
	(path p5-3 s5)
	(path s3 p5-3)
	(path p5-3 s3)
	(path s5 p5-15)
	(path p5-15 s5)
	(path s15 p5-15)
	(path p5-15 s15)
	(path s5 p5-16)
	(path p5-16 s5)
	(path s16 p5-16)
	(path p5-16 s16)
	(path s6 p6-0)
	(path p6-0 s6)
	(path s0 p6-0)
	(path p6-0 s0)
	(path s6 p6-10)
	(path p6-10 s6)
	(path s10 p6-10)
	(path p6-10 s10)
	(path s6 p6-15)
	(path p6-15 s6)
	(path s15 p6-15)
	(path p6-15 s15)
	(path s6 p6-19)
	(path p6-19 s6)
	(path s19 p6-19)
	(path p6-19 s19)
	(path s7 p7-0)
	(path p7-0 s7)
	(path s0 p7-0)
	(path p7-0 s0)
	(path s7 p7-4)
	(path p7-4 s7)
	(path s4 p7-4)
	(path p7-4 s4)
	(path s7 p7-5)
	(path p7-5 s7)
	(path s5 p7-5)
	(path p7-5 s5)
	(path s10 p10-11)
	(path p10-11 s10)
	(path s11 p10-11)
	(path p10-11 s11)
	(path s11 p11-3)
	(path p11-3 s11)
	(path s3 p11-3)
	(path p11-3 s3)
	(path s11 p11-8)
	(path p11-8 s11)
	(path s8 p11-8)
	(path p11-8 s8)
	(path s12 p12-8)
	(path p12-8 s12)
	(path s8 p12-8)
	(path p12-8 s8)
	(path s13 p13-5)
	(path p13-5 s13)
	(path s5 p13-5)
	(path p13-5 s5)
	(path s13 p13-12)
	(path p13-12 s13)
	(path s12 p13-12)
	(path p13-12 s12)
	(path s16 p16-6)
	(path p16-6 s16)
	(path s6 p16-6)
	(path p16-6 s6)
	(path s17 p17-10)
	(path p17-10 s17)
	(path s10 p17-10)
	(path p17-10 s10)
	(path s18 p18-4)
	(path p18-4 s18)
	(path s4 p18-4)
	(path p18-4 s4)
	(path s18 p18-8)
	(path p18-8 s18)
	(path s8 p18-8)
	(path p18-8 s8)
	(path s18 p18-14)
	(path p18-14 s18)
	(path s14 p18-14)
	(path p18-14 s14)
	(path s18 p18-17)
	(path p18-17 s18)
	(path s17 p18-17)
	(path p18-17 s17)
	(path s19 p19-18)
	(path p19-18 s19)
	(path s18 p19-18)
	(path p19-18 s18)
	(link s0 s8)
	(link s8 s0)
	(link s0 s18)
	(link s18 s0)
	(link s0 s19)
	(link s19 s0)
	(link s1 s3)
	(link s3 s1)
	(link s1 s7)
	(link s7 s1)
	(link s1 s9)
	(link s9 s1)
	(link s1 s11)
	(link s11 s1)
	(link s1 s12)
	(link s12 s1)
	(link s1 s13)
	(link s13 s1)
	(link s2 s6)
	(link s6 s2)
	(link s2 s14)
	(link s14 s2)
	(link s3 s4)
	(link s4 s3)
	(link s3 s6)
	(link s6 s3)
	(link s3 s14)
	(link s14 s3)
	(link s3 s17)
	(link s17 s3)
	(link s4 s14)
	(link s14 s4)
	(link s4 s16)
	(link s16 s4)
	(link s5 s1)
	(link s1 s5)
	(link s5 s3)
	(link s3 s5)
	(link s5 s9)
	(link s9 s5)
	(link s6 s4)
	(link s4 s6)
	(link s6 s5)
	(link s5 s6)
	(link s7 s0)
	(link s0 s7)
	(link s7 s3)
	(link s3 s7)
	(link s7 s8)
	(link s8 s7)
	(link s7 s13)
	(link s13 s7)
	(link s7 s14)
	(link s14 s7)
	(link s7 s15)
	(link s15 s7)
	(link s8 s2)
	(link s2 s8)
	(link s8 s6)
	(link s6 s8)
	(link s8 s11)
	(link s11 s8)
	(link s8 s12)
	(link s12 s8)
	(link s8 s17)
	(link s17 s8)
	(link s9 s4)
	(link s4 s9)
	(link s9 s8)
	(link s8 s9)
	(link s9 s12)
	(link s12 s9)
	(link s9 s13)
	(link s13 s9)
	(link s9 s18)
	(link s18 s9)
	(link s10 s0)
	(link s0 s10)
	(link s10 s18)
	(link s18 s10)
	(link s11 s2)
	(link s2 s11)
	(link s11 s4)
	(link s4 s11)
	(link s11 s12)
	(link s12 s11)
	(link s11 s14)
	(link s14 s11)
	(link s13 s0)
	(link s0 s13)
	(link s13 s10)
	(link s10 s13)
	(link s13 s14)
	(link s14 s13)
	(link s13 s17)
	(link s17 s13)
	(link s14 s6)
	(link s6 s14)
	(link s14 s8)
	(link s8 s14)
	(link s14 s12)
	(link s12 s14)
	(link s15 s2)
	(link s2 s15)
	(link s15 s17)
	(link s17 s15)
	(link s16 s0)
	(link s0 s16)
	(link s16 s14)
	(link s14 s16)
	(link s16 s18)
	(link s18 s16)
	(link s16 s19)
	(link s19 s16)
	(link s17 s4)
	(link s4 s17)
	(link s17 s12)
	(link s12 s17)
	(link s17 s18)
	(link s18 s17)
	(link s18 s1)
	(link s1 s18)
	(link s18 s2)
	(link s2 s18)
	(link s18 s3)
	(link s3 s18)
	(link s19 s8)
	(link s8 s19)
	(link s19 s11)
	(link s11 s19)
	(link s19 s14)
	(link s14 s19)
)
	(:goal (and
	(at driver1 s1)
	(at driver5 s9)
	(at truck1 s17)
	(at truck2 s0)
	(at truck3 s3)
	(at truck5 s9)
	(at package1 s1)
	(at package2 s7)
	(at package4 s10)
	(at package5 s15)
	(at package6 s7)
	(at package7 s10)
	(at package9 s7)
	(at package10 s10)
	(at package11 s13)
	(at package12 s12)
	(at package13 s12)
	(at package14 s15)
	(at package15 s18)
	(at package16 s8)
	(at package17 s16)
	(at package18 s3)
	(at package19 s2)
	))

)

; plan
1. (walk driver2 s6 p6-15)
   deleted: (at driver2 s6)
   added: (at driver2 p6-15)
   goals met: 0 of 23
2. (load-truck package15 truck2 s3)
   deleted: (at package15 s3)
   added: (in package15 truck2)
   goals met: 0 of 23
3. (load-truck package1 truck2 s3)
   deleted: (at package1 s3)
   added: (in package1 truck2)
   goals met: 0 of 23
4. (load-truck package4 truck5 s2)
   deleted: (at package4 s2)
   added: (in package4 truck5)
   goals met: 0 of 23
5. (load-truck package16 truck5 s2)
   deleted: (at package16 s2)
   added: (in package16 truck5)
   goals met: 0 of 23
6. (walk driver5 s4 p7-4)
   deleted: (at driver5 s4)
   added: (at driver5 p7-4)
   goals met: 0 of 23
7. (walk driver5 p7-4 s7)
   deleted: (at driver5 p7-4)
   added: (at driver5 s7)
   goals met: 0 of 23
8. (walk driver5 s7 p7-0)
   deleted: (at driver5 s7)
   added: (at driver5 p7-0)
   goals met: 0 of 23
9. (walk driver5 p7-0 s0)
   deleted: (at driver5 p7-0)
   added: (at driver5 s0)
   goals met: 0 of 23
10. (walk driver5 s0 p0-9)
   deleted: (at driver5 s0)
   added: (at driver5 p0-9)
   goals met: 0 of 23
11. (walk driver5 p0-9 s9)
   deleted: (at driver5 p0-9)
   added: (at driver5 s9)
   goals met: 1 of 23
12. (walk driver1 s11 p11-3)
   deleted: (at driver1 s11)
   added: (at driver1 p11-3)
   goals met: 1 of 23
13. (board-truck driver4 truck5 s2)
   deleted: (at driver4 s2) (empty truck5)
   added: (driving driver4 truck5)
   goals met: 1 of 23
14. (drive-truck truck5 s2 s14 driver4)
   deleted: (at truck5 s2)
   added: (at truck5 s14)
   goals met: 1 of 23
15. (load-truck package14 truck5 s14)
   deleted: (at package14 s14)
   added: (in package14 truck5)
   goals met: 1 of 23
16. (walk driver1 p11-3 s3)
   deleted: (at driver1 p11-3)
   added: (at driver1 s3)
   goals met: 1 of 23
17. (drive-truck truck5 s14 s7 driver4)
   deleted: (at truck5 s14)
   added: (at truck5 s7)
   goals met: 1 of 23
18. (load-truck package7 truck5 s7)
   deleted: (at package7 s7)
   added: (in package7 truck5)
   goals met: 1 of 23
19. (drive-truck truck5 s7 s8 driver4)
   deleted: (at truck5 s7)
   added: (at truck5 s8)
   goals met: 1 of 23
20. (unload-truck package16 truck5 s8)
   deleted: (in package16 truck5)
   added: (at package16 s8)
   goals met: 2 of 23
21. (drive-truck truck5 s8 s0 driver4)
   deleted: (at truck5 s8)
   added: (at truck5 s0)
   goals met: 2 of 23
22. (drive-truck truck5 s0 s18 driver4)
   deleted: (at truck5 s0)
   added: (at truck5 s18)
   goals met: 2 of 23
23. (load-truck package9 truck5 s18)
   deleted: (at package9 s18)
   added: (in package9 truck5)
   goals met: 2 of 23
24. (load-truck package2 truck5 s18)
   deleted: (at package2 s18)
   added: (in package2 truck5)
   goals met: 2 of 23
25. (load-truck package17 truck5 s18)
   deleted: (at package17 s18)
   added: (in package17 truck5)
   goals met: 2 of 23
26. (drive-truck truck5 s18 s9 driver4)
   deleted: (at truck5 s18)
   added: (at truck5 s9)
   goals met: 3 of 23
27. (drive-truck truck5 s9 s13 driver4)
   deleted: (at truck5 s9)
   added: (at truck5 s13)
   goals met: 2 of 23
28. (drive-truck truck5 s13 s14 driver4)
   deleted: (at truck5 s13)
   added: (at truck5 s14)
   goals met: 2 of 23
29. (drive-truck truck5 s14 s7 driver4)
   deleted: (at truck5 s14)
   added: (at truck5 s7)
   goals met: 2 of 23
30. (unload-truck package9 truck5 s7)
   deleted: (in package9 truck5)
   added: (at package9 s7)
   goals met: 3 of 23
31. (unload-truck package2 truck5 s7)
   deleted: (in package2 truck5)
   added: (at package2 s7)
   goals met: 4 of 23
32. (drive-truck truck5 s7 s14 driver4)
   deleted: (at truck5 s7)
   added: (at truck5 s14)
   goals met: 4 of 23
33. (board-truck driver1 truck2 s3)
   deleted: (at driver1 s3) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 4 of 23
34. (load-truck package5 truck2 s3)
   deleted: (at package5 s3)
   added: (in package5 truck2)
   goals met: 4 of 23
35. (load-truck package10 truck2 s3)
   deleted: (at package10 s3)
   added: (in package10 truck2)
   goals met: 4 of 23
36. (drive-truck truck5 s14 s13 driver4)
   deleted: (at truck5 s14)
   added: (at truck5 s13)
   goals met: 4 of 23
37. (load-truck package13 truck5 s13)
   deleted: (at package13 s13)
   added: (in package13 truck5)
   goals met: 4 of 23
38. (drive-truck truck5 s13 s14 driver4)
   deleted: (at truck5 s13)
   added: (at truck5 s14)
   goals met: 4 of 23
39. (drive-truck truck2 s3 s1 driver1)
   deleted: (at truck2 s3)
   added: (at truck2 s1)
   goals met: 4 of 23
40. (unload-truck package1 truck2 s1)
   deleted: (in package1 truck2)
   added: (at package1 s1)
   goals met: 5 of 23
41. (disembark-truck driver1 truck2 s1)
   deleted: (driving driver1 truck2)
   added: (at driver1 s1) (empty truck2)
   goals met: 6 of 23
42. (board-truck driver3 truck2 s1)
   deleted: (at driver3 s1) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 6 of 23
43. (drive-truck truck2 s1 s7 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s7)
   goals met: 6 of 23
44. (drive-truck truck2 s7 s15 driver3)
   deleted: (at truck2 s7)
   added: (at truck2 s15)
   goals met: 6 of 23
45. (unload-truck package5 truck2 s15)
   deleted: (in package5 truck2)
   added: (at package5 s15)
   goals met: 7 of 23
46. (load-truck package18 truck2 s15)
   deleted: (at package18 s15)
   added: (in package18 truck2)
   goals met: 7 of 23
47. (drive-truck truck2 s15 s7 driver3)
   deleted: (at truck2 s15)
   added: (at truck2 s7)
   goals met: 7 of 23
48. (drive-truck truck2 s7 s3 driver3)
   deleted: (at truck2 s7)
   added: (at truck2 s3)
   goals met: 7 of 23
49. (unload-truck package18 truck2 s3)
   deleted: (in package18 truck2)
   added: (at package18 s3)
   goals met: 8 of 23
50. (drive-truck truck2 s3 s18 driver3)
   deleted: (at truck2 s3)
   added: (at truck2 s18)
   goals met: 8 of 23
51. (unload-truck package15 truck2 s18)
   deleted: (in package15 truck2)
   added: (at package15 s18)
   goals met: 9 of 23
52. (drive-truck truck2 s18 s0 driver3)
   deleted: (at truck2 s18)
   added: (at truck2 s0)
   goals met: 10 of 23
53. (drive-truck truck5 s14 s12 driver4)
   deleted: (at truck5 s14)
   added: (at truck5 s12)
   goals met: 10 of 23
54. (unload-truck package13 truck5 s12)
   deleted: (in package13 truck5)
   added: (at package13 s12)
   goals met: 11 of 23
55. (drive-truck truck5 s12 s9 driver4)
   deleted: (at truck5 s12)
   added: (at truck5 s9)
   goals met: 12 of 23
56. (drive-truck truck2 s0 s10 driver3)
   deleted: (at truck2 s0)
   added: (at truck2 s10)
   goals met: 11 of 23
57. (unload-truck package10 truck2 s10)
   deleted: (in package10 truck2)
   added: (at package10 s10)
   goals met: 12 of 23
58. (load-truck package6 truck2 s10)
   deleted: (at package6 s10)
   added: (in package6 truck2)
   goals met: 12 of 23
59. (drive-truck truck2 s10 s0 driver3)
   deleted: (at truck2 s10)
   added: (at truck2 s0)
   goals met: 13 of 23
60. (drive-truck truck2 s0 s7 driver3)
   deleted: (at truck2 s0)
   added: (at truck2 s7)
   goals met: 12 of 23
61. (unload-truck package6 truck2 s7)
   deleted: (in package6 truck2)
   added: (at package6 s7)
   goals met: 13 of 23
62. (drive-truck truck2 s7 s0 driver3)
   deleted: (at truck2 s7)
   added: (at truck2 s0)
   goals met: 14 of 23
63. (drive-truck truck5 s9 s18 driver4)
   deleted: (at truck5 s9)
   added: (at truck5 s18)
   goals met: 13 of 23
64. (drive-truck truck5 s18 s10 driver4)
   deleted: (at truck5 s18)
   added: (at truck5 s10)
   goals met: 13 of 23
65. (unload-truck package7 truck5 s10)
   deleted: (in package7 truck5)
   added: (at package7 s10)
   goals met: 14 of 23
66. (unload-truck package4 truck5 s10)
   deleted: (in package4 truck5)
   added: (at package4 s10)
   goals met: 15 of 23
67. (drive-truck truck5 s10 s18 driver4)
   deleted: (at truck5 s10)
   added: (at truck5 s18)
   goals met: 15 of 23
68. (drive-truck truck5 s18 s16 driver4)
   deleted: (at truck5 s18)
   added: (at truck5 s16)
   goals met: 15 of 23
69. (unload-truck package17 truck5 s16)
   deleted: (in package17 truck5)
   added: (at package17 s16)
   goals met: 16 of 23
70. (load-truck package19 truck5 s16)
   deleted: (at package19 s16)
   added: (in package19 truck5)
   goals met: 16 of 23
71. (load-truck package11 truck5 s16)
   deleted: (at package11 s16)
   added: (in package11 truck5)
   goals met: 16 of 23
72. (drive-truck truck5 s16 s14 driver4)
   deleted: (at truck5 s16)
   added: (at truck5 s14)
   goals met: 16 of 23
73. (drive-truck truck5 s14 s2 driver4)
   deleted: (at truck5 s14)
   added: (at truck5 s2)
   goals met: 16 of 23
74. (unload-truck package19 truck5 s2)
   deleted: (in package19 truck5)
   added: (at package19 s2)
   goals met: 17 of 23
75. (drive-truck truck5 s2 s15 driver4)
   deleted: (at truck5 s2)
   added: (at truck5 s15)
   goals met: 17 of 23
76. (unload-truck package14 truck5 s15)
   deleted: (in package14 truck5)
   added: (at package14 s15)
   goals met: 18 of 23
77. (drive-truck truck5 s15 s17 driver4)
   deleted: (at truck5 s15)
   added: (at truck5 s17)
   goals met: 18 of 23
78. (drive-truck truck5 s17 s13 driver4)
   deleted: (at truck5 s17)
   added: (at truck5 s13)
   goals met: 18 of 23
79. (unload-truck package11 truck5 s13)
   deleted: (in package11 truck5)
   added: (at package11 s13)
   goals met: 19 of 23
80. (drive-truck truck5 s13 s10 driver4)
   deleted: (at truck5 s13)
   added: (at truck5 s10)
   goals met: 19 of 23
81. (drive-truck truck2 s0 s13 driver3)
   deleted: (at truck2 s0)
   added: (at truck2 s13)
   goals met: 18 of 23
82. (disembark-truck driver3 truck2 s13)
   deleted: (driving driver3 truck2)
   added: (at driver3 s13) (empty truck2)
   goals met: 18 of 23
83. (load-truck package12 truck5 s10)
   deleted: (at package12 s10)
   added: (in package12 truck5)
   goals met: 18 of 23
84. (drive-truck truck5 s10 s18 driver4)
   deleted: (at truck5 s10)
   added: (at truck5 s18)
   goals met: 18 of 23
85. (drive-truck truck5 s18 s9 driver4)
   deleted: (at truck5 s18)
   added: (at truck5 s9)
   goals met: 19 of 23
86. (drive-truck truck5 s9 s12 driver4)
   deleted: (at truck5 s9)
   added: (at truck5 s12)
   goals met: 18 of 23
87. (unload-truck package12 truck5 s12)
   deleted: (in package12 truck5)
   added: (at package12 s12)
   goals met: 19 of 23
88. (drive-truck truck5 s12 s8 driver4)
   deleted: (at truck5 s12)
   added: (at truck5 s8)
   goals met: 19 of 23
89. (disembark-truck driver4 truck5 s8)
   deleted: (driving driver4 truck5)
   added: (at driver4 s8) (empty truck5)
   goals met: 19 of 23
90. (board-truck driver4 truck3 s8)
   deleted: (at driver4 s8) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 19 of 23
91. (drive-truck truck3 s8 s7 driver4)
   deleted: (at truck3 s8)
   added: (at truck3 s7)
   goals met: 19 of 23
92. (drive-truck truck3 s7 s3 driver4)
   deleted: (at truck3 s7)
   added: (at truck3 s3)
   goals met: 20 of 23
93. (walk driver3 s13 p13-12)
   deleted: (at driver3 s13)
   added: (at driver3 p13-12)
   goals met: 20 of 23
94. (walk driver3 p13-12 s12)
   deleted: (at driver3 p13-12)
   added: (at driver3 s12)
   goals met: 20 of 23
95. (board-truck driver3 truck1 s12)
   deleted: (at driver3 s12) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 20 of 23
96. (disembark-truck driver4 truck3 s3)
   deleted: (driving driver4 truck3)
   added: (at driver4 s3) (empty truck3)
   goals met: 20 of 23
97. (walk driver4 s3 p3-13)
   deleted: (at driver4 s3)
   added: (at driver4 p3-13)
   goals met: 20 of 23
98. (drive-truck truck1 s12 s17 driver3)
   deleted: (at truck1 s12)
   added: (at truck1 s17)
   goals met: 21 of 23
99. (walk driver4 p3-13 s13)
   deleted: (at driver4 p3-13)
   added: (at driver4 s13)
   goals met: 21 of 23
100. (board-truck driver4 truck2 s13)
   deleted: (at driver4 s13) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 21 of 23
101. (drive-truck truck2 s13 s0 driver4)
   deleted: (at truck2 s13)
   added: (at truck2 s0)
   goals met: 22 of 23
102. (disembark-truck driver3 truck1 s17)
   deleted: (driving driver3 truck1)
   added: (at driver3 s17) (empty truck1)
   goals met: 22 of 23
103. (walk driver3 s17 p18-17)
   deleted: (at driver3 s17)
   added: (at driver3 p18-17)
   goals met: 22 of 23
104. (walk driver3 p18-17 s18)
   deleted: (at driver3 p18-17)
   added: (at driver3 s18)
   goals met: 22 of 23
105. (walk driver3 s18 p18-8)
   deleted: (at driver3 s18)
   added: (at driver3 p18-8)
   goals met: 22 of 23
106. (walk driver3 p18-8 s8)
   deleted: (at driver3 p18-8)
   added: (at driver3 s8)
   goals met: 22 of 23
107. (board-truck driver3 truck5 s8)
   deleted: (at driver3 s8) (empty truck5)
   added: (driving driver3 truck5)
   goals met: 22 of 23
108. (drive-truck truck5 s8 s9 driver3)
   deleted: (at truck5 s8)
   added: (at truck5 s9)
   goals met: 23 of 23
